{
  "backend/main.mo": "Motoko actor providing access control, page view counting, user profiles, restaurant search types, caching, error logging, and API request tracking.",
  "feature_evidence.json": "Feature evidence report listing implemented features, related files, components, and test identifiers.",
  "frontend-file-summaries.txt": "Prewritten summaries of major frontend files including components, hooks, utilities, and styling.",
  "frontend/index.css": "Tailwind base stylesheet defining OKLCH color tokens and theme-aware CSS variables for light and dark mode.",
  "frontend/index.html": "Basic HTML entry point loading the React application via main.tsx.",
  "frontend/src/App.tsx": "Main React app wiring search flows, results handling, settings panel, visit counter, theming, and query client setup.",
  "frontend/src/components/EmptyState.tsx": "UI component showing a friendly prompt and fallback message before any search is performed.",
  "frontend/src/components/Footer.tsx": "Footer displaying attribution, data source links, and a resilient visit counter with fallback text.",
  "frontend/src/components/FoursquareSettingsPanel.tsx": "UI panel for viewing Foursquare API config status and adding or clearing the API key.",
  "frontend/src/components/Header.tsx": "Sticky page header displaying the site logo, title, and a location hint.",
  "frontend/src/components/LoadingState.tsx": "Shows a loading indicator and skeleton placeholders while restaurant results are loading.",
  "frontend/src/components/RestaurantList.tsx": "Displays restaurant cards with details and supports selection and map navigation.",
  "frontend/src/components/RestaurantMap.tsx": "Loads and renders a Leaflet map with restaurant markers, handling errors and selection events.",
  "frontend/src/components/RestaurantResults.tsx": "Controls overall results display, handling loading, errors, safe mode, and switching between list and map views.",
  "frontend/src/components/SearchSection.tsx": "Manages city and geolocation-based search logic, including GPS/IP detection, validation, and rate‑limited updates.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous backend actor using react‑query, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useFoursquareConfig.ts": "Manages Foursquare API key status and mutations via the backend actor, including saving, clearing, and checking configuration.",
  "frontend/src/hooks/useGeolocationWatch.ts": "Watches the user's geolocation with error handling, tracking status, source, position, and providing start/stop controls.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and helpers for Internet Identity authentication, including login, logout, status tracking, and identity persistence.",
  "frontend/src/hooks/useLocationDiagnostics.ts": "Reports browser geolocation capability, secure‑context status, and permission state using the Permissions API.",
  "frontend/src/hooks/useQueries.ts": "Coordinates restaurant search logic combining Overpass and Foursquare data, with error handling, retries, and result merging.",
  "frontend/src/hooks/useTrafficCounter.ts": "Tracks and increments page‑view counts via the backend actor with retry logic and session‑based increment limiting.",
  "frontend/src/index.css": "Defines Tailwind layers, theme color variables including halal variants, dark mode overrides, background styling, and Leaflet adjustments.",
  "frontend/src/lib/coordinates.ts": "Provides coordinate validation logic ensuring numeric, finite lat/lon values within valid ranges.",
  "frontend/src/lib/haversine.ts": "Implements the Haversine formula to compute great‑circle distances between two coordinates.",
  "frontend/src/lib/overpass.ts": "Builds Overpass QL queries to fetch halal‑related POIs near a location using multiple tag patterns.",
  "frontend/src/lib/placesMerge.ts": "Provides name normalization, similarity checks, distance-based duplicate detection, and merging/sorting of restaurant data.",
  "frontend/src/lib/rateLimit.ts": "Implements a simple time-based rate limiter with execution control and reset functionality.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentity providers and loads global styles.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, storing, and clearing URL parameters with session persistence and hash handling.",
  "frontend/tailwind.config.js": "Configures Tailwind with dark mode, theme extensions, halal colors, components, and plugins like typography and animations.",
  "project_state.json": "Tracks project metadata including schema versions, feature specs, and known issues. Highlights unstable location tracking and a missing visit counter as current fix requests."
}